src/DataProcessors/НаборПерсонала/НаборПерсонала.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor>
  <name>НаборПерсонала</name>
  <comment>(Упр)</comment>
  <attributes>
    <name>УчетнаяЗапись</name>
    <type>
      <types>CatalogRef.УчетныеЗаписиЭлектроннойПочты</types>
    </type>
  </attributes>
  <attributes>
    <name>ОтображатьДолгосрочныеЗадачиДеревом</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ОтображатьКандидатовДеревом</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
</mdclass:DataProcessor>

src/Enums/ВидыОрганизационнойСтруктурыПредприятия/ВидыОрганизационнойСтруктурыПредприятия.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ВидыОрганизационнойСтруктурыПредприятия</name>
  <enumValues>
    <name>ПоСтруктуреЮридическихЛиц</name>
  </enumValues>
  <enumValues>
    <name>ПоЦентрамОтветственности</name>
  </enumValues>
</mdclass:Enum>

src/Documents/ЭлектронноеПисьмо/ЭлектронноеПисьмо.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ЭлектронноеПисьмо</name>
  <basedOn>Document.ЭлектронноеПисьмо</basedOn>
  <posting>Deny</posting>
  <registerRecords>InformationRegister.ПредметыЭлектронныхПисем</registerRecords>
  <registerRecords>InformationRegister.ОбъектыЭлектронныхПисемИСобытий</registerRecords>
  <registerRecords>AccumulationRegister.ПисьмаЭлектроннойПочты</registerRecords>
  <attributes>
    <name>ВидТекстаПисьма</name>
    <type>
      <types>EnumRef.ВидыТекстовЭлектронныхПисем</types>
    </type>
  </attributes>
  <attributes>
    <name>ГруппаУчетнойЗаписи</name>
    <type>
      <types>CatalogRef.ГруппыПисемЭлектроннойПочты</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаОтправления</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаТранспорта</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ЗаявкаКандидата</name>
    <type>
      <types>CatalogRef.ЗаявкиКандидатов</types>
    </type>
  </attributes>
  <attributes>
    <name>ЕстьВложения</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ЗаголовокПисьма</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ИдентификаторПисьма</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИмяКомпьютераРедактированияХТМЛТекста</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>400</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИмяФайлаРедактированияХТМЛТекста</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>400</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КодировкаПисьма</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>200</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Кому</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>КомуПредставление</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Копии</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>КопииПредставление</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>НеРассмотрено</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ОснованиеПисьма</name>
    <type>
      <types>DocumentRef.Событие</types>
      <types>DocumentRef.ЭлектронноеПисьмо</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответ</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ОтправительАдресЭлектроннойПочты</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОтправительИмя</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОтправительПредставление</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Оформление</name>
    <type>
      <types>CatalogRef.ОформленияСтрокПисем</types>
    </type>
  </attributes>
  <attributes>
    <name>Переадресация</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПочтовоеСообщение</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>ПредметКонтакта</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>РассмотретьПосле</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>СкрытыеКопии</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ОтправительОбъект</name>
    <type>
      <types>CatalogRef.ЛичныеКонтакты</types>
      <types>CatalogRef.КонтактныеЛица</types>
      <types>CatalogRef.ФизическиеЛица</types>
      <types>CatalogRef.Пользователи</types>
      <types>CatalogRef.Контрагенты</types>
      <types>CatalogRef.Организации</types>
      <types>CatalogRef.КонтактныеЛицаКонтрагентов</types>
    </type>
  </attributes>
  <attributes>
    <name>СостояниеПотомкаПисьма</name>
    <type>
      <types>EnumRef.СостоянияПотомковЭлектронныхПисем</types>
    </type>
  </attributes>
  <attributes>
    <name>СтатусПисьма</name>
    <type>
      <types>EnumRef.СтатусыПисем</types>
    </type>
  </attributes>
  <attributes>
    <name>ТекстПисьма</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Тема</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>400</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>УчетнаяЗапись</name>
    <type>
      <types>CatalogRef.УчетныеЗаписиЭлектроннойПочты</types>
    </type>
  </attributes>
  <tabularSections>
    <name>КомуТЧ</name>
    <attributes>
      <name>АдресЭлектроннойПочты</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Представление</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>250</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Объект</name>
      <type>
        <types>CatalogRef.ЛичныеКонтакты</types>
        <types>CatalogRef.КонтактныеЛица</types>
        <types>CatalogRef.ФизическиеЛица</types>
        <types>CatalogRef.Пользователи</types>
        <types>CatalogRef.Контрагенты</types>
        <types>CatalogRef.Организации</types>
        <types>CatalogRef.КонтактныеЛицаКонтрагентов</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>КопииТЧ</name>
    <attributes>
      <name>АдресЭлектроннойПочты</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Представление</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>250</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Объект</name>
      <type>
        <types>CatalogRef.ЛичныеКонтакты</types>
        <types>CatalogRef.КонтактныеЛица</types>
        <types>CatalogRef.ФизическиеЛица</types>
        <types>CatalogRef.Пользователи</types>
        <types>CatalogRef.Контрагенты</types>
        <types>CatalogRef.Организации</types>
        <types>CatalogRef.КонтактныеЛицаКонтрагентов</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>СкрытыеКопииТЧ</name>
    <attributes>
      <name>АдресЭлектроннойПочты</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Представление</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>250</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Объект</name>
      <type>
        <types>CatalogRef.ЛичныеКонтакты</types>
        <types>CatalogRef.КонтактныеЛица</types>
        <types>CatalogRef.ФизическиеЛица</types>
        <types>CatalogRef.Пользователи</types>
        <types>CatalogRef.Контрагенты</types>
        <types>CatalogRef.Организации</types>
        <types>CatalogRef.КонтактныеЛицаКонтрагентов</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

src/Catalogs/ЗаявкиКандидатов/ЗаявкиКандидатов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ЗаявкиКандидатов</name>
  <comment>(Упр)</comment>
  <attributes>
    <name>ФизЛицо</name>
    <type>
      <types>CatalogRef.ФизическиеЛица</types>
    </type>
  </attributes>
  <attributes>
    <name>Состояние</name>
    <type>
      <types>CatalogRef.СостоянияЗаявокКандидатов</types>
    </type>
  </attributes>
  <attributes>
    <name>Важность</name>
    <type>
      <types>EnumRef.Важность</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Закрыта</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>РезультатЗакрытия</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ГруппаЗаявок</name>
    <type>
      <types>CatalogRef.ГруппыЗаявокКандидатов</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаОткрытия</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИсточникИнформации</name>
    <type>
      <types>CatalogRef.ИсточникиИнформации</types>
    </type>
  </attributes>
  <attributes>
    <name>Вакансия</name>
    <type>
      <types>CatalogRef.Вакансии</types>
    </type>
  </attributes>
  <attributes>
    <name>Подразделение</name>
    <type>
      <types>CatalogRef.ПодразделенияОрганизаций</types>
      <types>CatalogRef.Подразделения</types>
    </type>
  </attributes>
  <attributes>
    <name>Должность</name>
    <type>
      <types>CatalogRef.Должности</types>
    </type>
  </attributes>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
</mdclass:Catalog>

src/Catalogs/Вакансии/Вакансии.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Вакансии</name>
  <attributes>
    <name>Закрыта</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Должность</name>
    <type>
      <types>CatalogRef.Должности</types>
    </type>
  </attributes>
  <attributes>
    <name>Заявитель</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Обязанности</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ПлановаяДатаЗакрытия</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Подразделение</name>
    <type>
      <types>CatalogRef.ПодразделенияОрганизаций</types>
      <types>CatalogRef.Подразделения</types>
    </type>
  </attributes>
  <attributes>
    <name>Требования</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Условия</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
</mdclass:Catalog>

src/Catalogs/ХранилищеДополнительнойИнформации/ХранилищеДополнительнойИнформации.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ХранилищеДополнительнойИнформации</name>
  <comment>Хранилище дополнительной информации</comment>
  <attributes>
    <name>ВидДанных</name>
    <comment>Вид данных</comment>
    <type>
      <types>EnumRef.ВидыДополнительнойИнформацииОбъектов</types>
    </type>
  </attributes>
  <attributes>
    <name>ИмяФайла</name>
    <comment>Имя файла</comment>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Объект</name>
    <comment>Объект</comment>
    <type>
      <types>CatalogRef.СерииНоменклатуры</types>
      <types>CatalogRef.Территории</types>
      <types>DocumentRef.ВнутреннееПеремещениеСредствПриБюджетировании</types>
      <types>ChartOfCharacteristicTypesRef.ВопросыДляАнкетирования</types>
      <types>DocumentRef.КадровоеПеремещениеОрганизаций</types>
      <types>DocumentRef.ЗаказНаПроизводство</types>
      <types>DocumentRef.ПриемНаРаботуВОрганизацию</types>
      <types>CatalogRef.Вакансии</types>
      <types>CatalogRef.Проекты</types>
      <types>CatalogRef.ФизическиеЛица</types>
      <types>CatalogRef.ЗаявкиКандидатов</types>
      <types>DocumentRef.РегистрацияКонтрагента</types>
      <types>DocumentRef.ЗаказПоставщику</types>
      <types>CatalogRef.Помещения</types>
      <types>DocumentRef.УвольнениеИзОрганизаций</types>
      <types>DocumentRef.ЗаказПокупателя</types>
      <types>DocumentRef.ЗаявкаНаРасходованиеСредств</types>
      <types>CatalogRef.Контрагенты</types>
      <types>CatalogRef.Организации</types>
      <types>DocumentRef.Событие</types>
      <types>CatalogRef.КомпетенцииРаботников</types>
      <types>DocumentRef.ЭлектронноеПисьмо</types>
      <types>CatalogRef.СпецификацииНоменклатуры</types>
      <types>CatalogRef.Номенклатура</types>
      <types>DocumentRef.ПрохождениеКурсаОбучения</types>
      <types>DocumentRef.ПланируемоеПоступлениеДенежныхСредств</types>
      <types>DocumentRef.БюджетнаяОперация</types>
      <types>DocumentRef.АвансовыйОтчет</types>
      <types>CatalogRef.ДоговорыКонтрагентов</types>
      <types>CatalogRef.Склады</types>
    </type>
  </attributes>
  <attributes>
    <name>Хранилище</name>
    <comment>Хранилище</comment>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>ТекстФайла</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидДокумента</name>
    <type>
      <types>CatalogRef.ВидыДокументов</types>
    </type>
  </attributes>
  <attributes>
    <name>ВОблаке</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
</mdclass:Catalog>

src/DataProcessors/НаборПерсонала/ObjectModule.bsl
////////////////////////////////////////////////////////////////////////////////
// ЭКСПОРТНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ

Функция ПолучитьСписокНеРазобранныхПисем(ПолеДляУпорядочивания) Экспорт
	
	Если Не ПравоДоступа("Чтение", Метаданные.Документы.ЭлектронноеПисьмо) Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	
	Запрос.Текст =
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ЭлектронноеПисьмо.ОтправительПредставление КАК Отправитель,
	|	ЭлектронноеПисьмо.Тема КАК Тема,";
	Если ПолеДляУпорядочивания = "ДатаПолучения" Тогда
	Запрос.Текст = Запрос.Текст + "
	|	ВЫБОР
	|		КОГДА НАЧАЛОПЕРИОДА(ЭлектронноеПисьмо.ДатаТранспорта, ДЕНЬ) = ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
	|			ТОГДА 1
	|		ИНАЧЕ 2
	|	КОНЕЦ КАК ДополнительноеУпорядочивание,";
	КонецЕсли;
	Запрос.Текст = Запрос.Текст + "
	|	НАЧАЛОПЕРИОДА(ЭлектронноеПисьмо.ДатаТранспорта, ДЕНЬ) КАК ДатаПолучения,
	|	ЭлектронноеПисьмо.Ссылка,
	|	ЭлектронноеПисьмо.НеРассмотрено,
	|	ЭлектронноеПисьмо.РассмотретьПосле,
	|	ЭлектронноеПисьмо.СтатусПисьма
	|ИЗ
	|	Документ.ЭлектронноеПисьмо КАК ЭлектронноеПисьмо
	|ГДЕ
	|	ЭлектронноеПисьмо.ЗаявкаКандидата = ЗНАЧЕНИЕ(Справочник.ЗаявкиКандидатов.ПустаяСсылка)
	|	И (НЕ ЭлектронноеПисьмо.ПометкаУдаления)
	|	И ЭлектронноеПисьмо.НеРассмотрено
	|
	|УПОРЯДОЧИТЬ ПО
	|	"+?(ПолеДляУпорядочивания = "ДатаПолучения", "ДополнительноеУпорядочивание,", "")+"
	|	"+ПолеДляУпорядочивания+" "+ПолучитьНаправлениеУпорядочивания(ПолеДляУпорядочивания);
	
	Возврат Запрос.Выполнить().Выбрать();
	
КонецФункции

Функция ПолучитьСписокЗаявок(ПолеДляУпорядочивания, РежимНабораПерсонала) Экспорт
	
	Запрос = Новый Запрос;
	
	Если ПравоДоступа("Чтение", Метаданные.Документы.ЭлектронноеПисьмо) Тогда
		Запрос.Текст =
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
		|	ЗаявкиКандидатов.Наименование КАК Наименование,
		|	ЗаявкиКандидатов.Ссылка КАК Ссылка";
		Если ПолеДляУпорядочивания = "ДатаСобытия" Тогда
		Запрос.Текст = Запрос.Текст + ",
		|	ЕСТЬNULL(НАЧАЛОПЕРИОДА(События.ДатаСобытия, ДЕНЬ), ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)) КАК ДатаСобытия,
		|	ВЫБОР
		|		КОГДА ЕСТЬNULL(НАЧАЛОПЕРИОДА(События.ДатаСобытия, ДЕНЬ), ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)) = ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
		|			ТОГДА 1
		|		ИНАЧЕ 2
		|	КОНЕЦ КАК ДополнительноеУпорядочивание";
		ИначеЕсли ПолеДляУпорядочивания = "Ответственный" Тогда
		Запрос.Текст = Запрос.Текст + ",
		|	ВЫБОР
		|		КОГДА ЗаявкиКандидатов.Ответственный = ЗНАЧЕНИЕ(Справочник.Пользователи.ПустаяСсылка)
		|			ТОГДА ЕСТЬNULL(ЗаявкиКандидатов.Вакансия.Ответственный,ЗНАЧЕНИЕ(Справочник.Пользователи.ПустаяСсылка))
		|		ИНАЧЕ ЗаявкиКандидатов.Ответственный
		|	КОНЕЦ КАК Ответственный";
		ИначеЕсли ПолеДляУпорядочивания = "Подразделение" Тогда
			Если РежимНабораПерсонала = Перечисления.ВидыОрганизационнойСтруктурыПредприятия.ПоСтруктуреЮридическихЛиц Тогда
		Запрос.Текст = Запрос.Текст + ",
		|	ВЫБОР
		|		КОГДА ЗаявкиКандидатов.Вакансия = ЗНАЧЕНИЕ(Справочник.Вакансии.ПустаяСсылка)
		|			ТОГДА ВЫБОР КОГДА ЗаявкиКандидатов.Подразделение ССЫЛКА Справочник.ПодразделенияОрганизаций ТОГДА ЗаявкиКандидатов.Подразделение ИНАЧЕ ЗНАЧЕНИЕ(Справочник.ПодразделенияОрганизаций.ПустаяСсылка) КОНЕЦ
		|		ИНАЧЕ ВЫБОР КОГДА ЗаявкиКандидатов.Вакансия.Подразделение ССЫЛКА Справочник.ПодразделенияОрганизаций ТОГДА ЗаявкиКандидатов.Вакансия.Подразделение ИНАЧЕ ЗНАЧЕНИЕ(Справочник.ПодразделенияОрганизаций.ПустаяСсылка) КОНЕЦ
		|	КОНЕЦ КАК Подразделение";
			Иначе
		Запрос.Текст = Запрос.Текст + ",
		|	ВЫБОР
		|		КОГДА ЗаявкиКандидатов.Вакансия = ЗНАЧЕНИЕ(Справочник.Вакансии.ПустаяСсылка)
		|			ТОГДА ВЫБОР КОГДА ЗаявкиКандидатов.Подразделение ССЫЛКА Справочник.Подразделения ТОГДА ЗаявкиКандидатов.Подразделение ИНАЧЕ ЗНАЧЕНИЕ(Справочник.Подразделения.ПустаяСсылка) КОНЕЦ
		|		ИНАЧЕ ВЫБОР КОГДА ЗаявкиКандидатов.Вакансия.Подразделение ССЫЛКА Справочник.Подразделения ТОГДА ЗаявкиКандидатов.Вакансия.Подразделение ИНАЧЕ ЗНАЧЕНИЕ(Справочник.Подразделения.ПустаяСсылка) КОНЕЦ
		|	КОНЕЦ КАК Подразделение";
			КонецЕсли;
		ИначеЕсли ПолеДляУпорядочивания = "Должность" Тогда
		Запрос.Текст = Запрос.Текст + ",
		|	ВЫБОР
		|		КОГДА ЗаявкиКандидатов.Вакансия = ЗНАЧЕНИЕ(Справочник.Вакансии.ПустаяСсылка)
		|			ТОГДА ЗаявкиКандидатов.Должность
		|		ИНАЧЕ ЗаявкиКандидатов.Вакансия.Должность
		|	КОНЕЦ КАК Должность";
		Иначе
		Запрос.Текст = Запрос.Текст + ",
		|	ЗаявкиКандидатов."+ПолеДляУпорядочивания;
		КонецЕсли;
		Запрос.Текст = Запрос.Текст + "
		|ИЗ
		|	Справочник.ЗаявкиКандидатов КАК ЗаявкиКандидатов";
		Если (ПолеДляУпорядочивания = "Состояние") ИЛИ (ПолеДляУпорядочивания = "ДатаСобытия") Тогда
		Запрос.Текст = Запрос.Текст + "
		|		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
		|			ВложенныйЗапрос.ЗаявкаКандидата КАК ЗаявкаКандидата,
		|			МАКСИМУМ(ВложенныйЗапрос.Дата) КАК ДатаСобытия
		|		ИЗ
		|			(ВЫБРАТЬ
		|				ЭлектронноеПисьмо.ЗаявкаКандидата КАК ЗаявкаКандидата,
		|				МАКСИМУМ(ВЫБОР
		|						КОГДА ЭлектронноеПисьмо.РассмотретьПосле > ЭлектронноеПисьмо.ДатаТранспорта
		|							ТОГДА ЭлектронноеПисьмо.РассмотретьПосле
		|						ИНАЧЕ ЭлектронноеПисьмо.ДатаТранспорта
		|					КОНЕЦ) КАК Дата
		|			ИЗ
		|				Документ.ЭлектронноеПисьмо КАК ЭлектронноеПисьмо
		|			ГДЕ
		|				ЭлектронноеПисьмо.НеРассмотрено
		|				И (НЕ ЭлектронноеПисьмо.ПометкаУдаления)
		|				И ЭлектронноеПисьмо.ЗаявкаКандидата <> ЗНАЧЕНИЕ(Справочник.ЗаявкиКандидатов.ПустаяСсылка)
		|	
		|			СГРУППИРОВАТЬ ПО
		|				ЭлектронноеПисьмо.ЗаявкаКандидата
		|	
		|			ОБЪЕДИНИТЬ
		|	
		|			ВЫБРАТЬ
		|				Событие.ЗаявкаКандидата,
		|				МАКСИМУМ(Событие.ВремяНапоминания)
		|			ИЗ
		|				Документ.Событие КАК Событие
		|			ГДЕ
		|				Событие.НапомнитьОСобытии
		|				И Событие.Проведен
		|				И Событие.ЗаявкаКандидата <> ЗНАЧЕНИЕ(Справочник.ЗаявкиКандидатов.ПустаяСсылка)
		|	
		|			СГРУППИРОВАТЬ ПО
		|				Событие.ЗаявкаКандидата
		|	
		|			ОБЪЕДИНИТЬ
		|	
		|			ВЫБРАТЬ
		|				ЗаявкиКандидатов.Ссылка,
		|				ЗаявкиКандидатов.ДатаОткрытия
		|			ИЗ
		|				Справочник.ЗаявкиКандидатов КАК ЗаявкиКандидатов) КАК ВложенныйЗапрос
		|		
		|				СГРУППИРОВАТЬ ПО
		|					ВложенныйЗапрос.ЗаявкаКандидата) КАК События
		|		ПО ЗаявкиКандидатов.Ссылка = События.ЗаявкаКандидата";
		КонецЕсли;
		Запрос.Текст = Запрос.Текст + "
		|ГДЕ
		|	(НЕ ЗаявкиКандидатов.Закрыта)
		|	И (НЕ ЗаявкиКандидатов.ПометкаУдаления)
		|
		|УПОРЯДОЧИТЬ ПО
		|	"+?(ПолеДляУпорядочивания = "ДатаСобытия", "ДополнительноеУпорядочивание,", "")+"
		|	"+ПолеДляУпорядочивания+" "+ПолучитьНаправлениеУпорядочивания(ПолеДляУпорядочивания);
		
	Иначе
		Запрос.Текст =
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
		|	ЗаявкиКандидатов.Наименование КАК Наименование,
		|	ЗаявкиКандидатов.Ссылка КАК Ссылка";
		Если ПолеДляУпорядочивания = "ДатаСобытия" Тогда
		Запрос.Текст = Запрос.Текст + ",
		|	ЕСТЬNULL(НАЧАЛОПЕРИОДА(События.ДатаСобытия, ДЕНЬ), ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)) КАК ДатаСобытия,
		|	ВЫБОР
		|		КОГДА ЕСТЬNULL(НАЧАЛОПЕРИОДА(События.ДатаСобытия, ДЕНЬ), ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)) = ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
		|			ТОГДА 1
		|		ИНАЧЕ 2
		|	КОНЕЦ КАК ДополнительноеУпорядочивание";
		ИначеЕсли ПолеДляУпорядочивания = "Ответственный" Тогда
		Запрос.Текст = Запрос.Текст + ",
		|	ВЫБОР
		|		КОГДА ЗаявкиКандидатов.Ответственный = ЗНАЧЕНИЕ(Справочник.Пользователи.ПустаяСсылка)
		|			ТОГДА ЕСТЬNULL(ЗаявкиКандидатов.Вакансия.Ответственный,ЗНАЧЕНИЕ(Справочник.Пользователи.ПустаяСсылка))
		|		ИНАЧЕ ЗаявкиКандидатов.Ответственный
		|	КОНЕЦ КАК Ответственный";
		ИначеЕсли ПолеДляУпорядочивания = "Подразделение" Тогда
			Если РежимНабораПерсонала = Перечисления.ВидыОрганизационнойСтруктурыПредприятия.ПоСтруктуреЮридическихЛиц Тогда
		Запрос.Текст = Запрос.Текст + ",
		|	ВЫБОР
		|		КОГДА ЗаявкиКандидатов.Вакансия = ЗНАЧЕНИЕ(Справочник.Вакансии.ПустаяСсылка)
		|			ТОГДА ВЫБОР КОГДА ЗаявкиКандидатов.Подразделение ССЫЛКА Справочник.ПодразделенияОрганизаций ТОГДА ЗаявкиКандидатов.Подразделение ИНАЧЕ ЗНАЧЕНИЕ(Справочник.ПодразделенияОрганизаций.ПустаяСсылка) КОНЕЦ
		|		ИНАЧЕ ВЫБОР КОГДА ЗаявкиКандидатов.Вакансия.Подразделение ССЫЛКА Справочник.ПодразделенияОрганизаций ТОГДА ЗаявкиКандидатов.Вакансия.Подразделение ИНАЧЕ ЗНАЧЕНИЕ(Справочник.ПодразделенияОрганизаций.ПустаяСсылка) КОНЕЦ
		|	КОНЕЦ КАК Подразделение";
			Иначе
		Запрос.Текст = Запрос.Текст + ",
		|	ВЫБОР
		|		КОГДА ЗаявкиКандидатов.Вакансия = ЗНАЧЕНИЕ(Справочник.Вакансии.ПустаяСсылка)
		|			ТОГДА ВЫБОР КОГДА ЗаявкиКандидатов.Подразделение ССЫЛКА Справочник.Подразделения ТОГДА ЗаявкиКандидатов.Подразделение ИНАЧЕ ЗНАЧЕНИЕ(Справочник.Подразделения.ПустаяСсылка) КОНЕЦ
		|		ИНАЧЕ ВЫБОР КОГДА ЗаявкиКандидатов.Вакансия.Подразделение ССЫЛКА Справочник.Подразделения ТОГДА ЗаявкиКандидатов.Вакансия.Подразделение ИНАЧЕ ЗНАЧЕНИЕ(Справочник.Подразделения.ПустаяСсылка) КОНЕЦ
		|	КОНЕЦ КАК Подразделение";
			КонецЕсли;
		ИначеЕсли ПолеДляУпорядочивания = "Должность" Тогда
		Запрос.Текст = Запрос.Текст + ",
		|	ВЫБОР
		|		КОГДА ЗаявкиКандидатов.Вакансия = ЗНАЧЕНИЕ(Справочник.Вакансии.ПустаяСсылка)
		|			ТОГДА ЗаявкиКандидатов.Должность
		|		ИНАЧЕ ЗаявкиКандидатов.Вакансия.Должность
		|	КОНЕЦ КАК Должность";
		Иначе
		Запрос.Текст = Запрос.Текст + ",
		|	ЗаявкиКандидатов."+ПолеДляУпорядочивания;
		КонецЕсли;
		Запрос.Текст = Запрос.Текст + "
		|ИЗ
		|	Справочник.ЗаявкиКандидатов КАК ЗаявкиКандидатов";
		Если (ПолеДляУпорядочивания = "Состояние") ИЛИ (ПолеДляУпорядочивания = "ДатаСобытия") Тогда
		Запрос.Текст = Запрос.Текст + "
		|		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
		|			ВложенныйЗапрос.ЗаявкаКандидата КАК ЗаявкаКандидата,
		|			МАКСИМУМ(ВложенныйЗапрос.Дата) КАК ДатаСобытия
		|		ИЗ
		|			(ВЫБРАТЬ
		|				Событие.ЗаявкаКандидата КАК ЗаявкаКандидата,
		|				МАКСИМУМ(Событие.ВремяНапоминания) КАК Дата
		|			ИЗ
		|				Документ.Событие КАК Событие
		|			ГДЕ
		|				Событие.НапомнитьОСобытии
		|				И Событие.Проведен
		|				И Событие.ЗаявкаКандидата <> ЗНАЧЕНИЕ(Справочник.ЗаявкиКандидатов.ПустаяСсылка)
		|	
		|			СГРУППИРОВАТЬ ПО
		|				Событие.ЗаявкаКандидата
		|	
		|			ОБЪЕДИНИТЬ
		|	
		|			ВЫБРАТЬ
		|				ЗаявкиКандидатов.Ссылка,
		|				ЗаявкиКандидатов.ДатаОткрытия
		|			ИЗ
		|				Справочник.ЗаявкиКандидатов КАК ЗаявкиКандидатов) КАК ВложенныйЗапрос
		|		
		|				СГРУППИРОВАТЬ ПО
		|					ВложенныйЗапрос.ЗаявкаКандидата) КАК События
		|		ПО ЗаявкиКандидатов.Ссылка = События.ЗаявкаКандидата";
		КонецЕсли;
		Запрос.Текст = Запрос.Текст + "
		|ГДЕ
		|	(НЕ ЗаявкиКандидатов.Закрыта)
		|	И (НЕ ЗаявкиКандидатов.ПометкаУдаления)
		|
		|УПОРЯДОЧИТЬ ПО
		|	"+?(ПолеДляУпорядочивания = "ДатаСобытия", "ДополнительноеУпорядочивание,", "")+"
		|	"+ПолеДляУпорядочивания+" "+ПолучитьНаправлениеУпорядочивания(ПолеДляУпорядочивания);
		
	КонецЕсли;
	
	Возврат Запрос.Выполнить().Выбрать();
	
КонецФункции


Функция ПолучитьСписокСобытийПоЗаявке(ЗаявкаСоискателя) Экспорт
	
	Запрос = Новый Запрос;
	
	Запрос.УстановитьПараметр("ЗаявкаСоискателя",	ЗаявкаСоискателя);
	Запрос.УстановитьПараметр("ТекущаяДата",		ТекущаяДата());
	
	Запрос.Текст =
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	Событие.ОписаниеСобытия,
	|	Событие.Ссылка,
	|	Событие.НачалоСобытия КАК НачалоСобытия,
	|	Событие.ОкончаниеСобытия
	|ИЗ
	|	Документ.Событие КАК Событие
	|ГДЕ
	|	Событие.ЗаявкаКандидата = &ЗаявкаСоискателя
	|	И Событие.Проведен
	|	И (Событие.ОкончаниеСобытия >= &ТекущаяДата
	|			ИЛИ Событие.НапомнитьОСобытии
	|				И Событие.ВремяНапоминания >= &ТекущаяДата)
	|
	|УПОРЯДОЧИТЬ ПО
	|	НачалоСобытия";
	
	Возврат Запрос.Выполнить().Выбрать();
	
КонецФункции

Функция ПолучитьСписокФайловПоЗаявке(ЗаявкаСоискателя) Экспорт
	
	Запрос = Новый Запрос;
	
	Запрос.УстановитьПараметр("ЗаявкаСоискателя",	ЗаявкаСоискателя);
	
	Запрос.Текст =
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ХранилищеДополнительнойИнформации.Ссылка,
	|	ВЫБОР
	|		КОГДА ХранилищеДополнительнойИнформации.Наименование ПОДОБНО """"
	|			ТОГДА ХранилищеДополнительнойИнформации.ИмяФайла
	|		ИНАЧЕ ХранилищеДополнительнойИнформации.Наименование
	|	КОНЕЦ КАК Наименование
	|ИЗ
	|	Справочник.ХранилищеДополнительнойИнформации КАК ХранилищеДополнительнойИнформации
	|ГДЕ
	|	ХранилищеДополнительнойИнформации.Объект = &ЗаявкаСоискателя";
	
	Возврат Запрос.Выполнить().Выбрать();
	
КонецФункции


Функция ПолучитьНаправлениеУпорядочивания(ИмяПоля) Экспорт
	
	Если ИмяПоля = "ДатаПолучения" ИЛИ ИмяПоля = "ДатаСобытия" Тогда
		Возврат "УБЫВ";
	Иначе
		Возврат "ВОЗР";
	КонецЕсли;
	
КонецФункции

Функция ПолучитьГруппировкуУпорядочивания(ИмяПоля) Экспорт
	
	Возврат (ИмяПоля <> "Отправитель") И (ИмяПоля <> "Наименование");
	
КонецФункции

////////////////////////////////////////////////////////////////////////////////
// ОПЕРАТОРЫ ОСНОВНОЙ ПРОГРАММЫ
